/**
   [ JS 연산자 과제1 ]
   문제11 : 정수 3개를 입력받아 오름차순 으로 출력    [ 7 5 9 -> 5 7 9]
   문제12 : [ 가위바위보 게임 ] 
   - 가위가 '0' 이고 바위가 '1' 이고 보가 '2' 일때 플레이어1와 플레이어2 가 있습니다. 
   - 승리자 판단과 무승부 경우의수를 출력하시오.
   [입력]
      플레이어1가 0 혹은 1 혹은 2 입력받아 변수에 저장합니다.
      플레이어2가 0 혹은 1 혹은 2 입력받아 변수에 저장합니다.
   [경우의수 판단]
      플레이어1 이겼을때 경우의수 ' 플레이어1 승리 ' 출력
      플레이어2 이겼을때 경우의수 ' 플레이어2 승리 ' 출력
      비겼을경우 '무승부' 출력
 */

 
 //문제11 정수 3개를 입력받아 오름차순 으로 출력    [ 7 5 9 -> 5 7 9]
 let 정수1 = Number(prompt('첫번째 정수를 입력하시오. : '))
 let 정수2 = Number(prompt('두번째 정수를 입력하시오. : '))
 let 정수3 = Number(prompt('세번째 정수를 입력하시오. : '))
 
 // 제일 큰 수 구하기
 let 정수4 = 정수1 < 정수2 ? 정수2 : 정수1 
 정수4 = 정수1 < 정수3 ? 정수3 : 정수1
 정수4 = 정수2 < 정수3 ? 정수3 : 정수2
 // 제일 작은 수 구하기
 let 정수5 = 정수1 > 정수2 ? 정수2 : 정수1 
 정수5 = 정수1 > 정수3 ? 정수3 : 정수1
 정수5 = 정수2 > 정수3 ? 정수3 : 정수2
 // 중간 수 구하기
 let 정수6 = ((정수1+정수2+정수3)-(정수4+정수5))
 
 console.log('입력받은 수 오름차순 정렬 :' + 정수5, 정수6, 정수4)
 
 
 //문제12 가위바위보 게임
 let 플레이어1 = prompt('플레이어1 가위(0), 바위(1), 보(2) 중 하나를 입력하세요. :')
 let 플레이어2 = prompt('플레이어2 가위(0), 바위(1), 보(2) 중 하나를 입력하세요. :')
 console.log(플레이어1==플레이어2 ? '무승부' : 플레이어2==(플레이어1+1)%3 ? '플레이어2 승' : '플레이어1 승')
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 