/*
	함수의 형태
		1. 인수x, 반환x 함수 
		2. 인수o, 반환x 함수
		3. 인수o, 반환o 함수
		4. 인수x, 반환o 함수
 */

 
 
 //1. 인수x,  반환x 함수  ----------------------------------------------
 function 함수1(){console.log ('함수1 실행'); }
 함수1() // *JS 에서의 함수 호출방법 [JS 실행시 최초 1번 실행]
 
 
 
 //2. 인수o = 2개,  반환x 함수  ----------------------------------------------
 function 함수2(x, y){// 아무거나 임의의 변수 넣기 가능
	console.log( x + y )
 }
 함수2( 3, 5 );
 함수2('코카콜라 :', 3 ); 
 
 //3. 인수o, 반환o 함수  ----------------------------------------------
 function 함수3(x, y){ console.log( x + y); return x + y;}
 let 결과 = 함수3( 3, 5 ); console.log ('함수3 결과/리턴 :' + 결과); // 리턴한 값을 저장함 !!!!
 
 
 //4. 인수x, 반환o  ----------------------------------------------
 function 함수4( ){ return 3 + 8 ; } // 함수를 강제 종료, 비록 아래에 코드가 있더라도 !! 
 let 결과2 = 함수4(); console.log (' 함수4 결과/리턴 :' + 결과2);
 
 //5. 함수정의시 함수 호출 가능 ----------------------------------------------
 function 함수5(){ 함수1(); }
 함수5() // 함수5를 부르면 함수1이 실행 된다 ! 함수5에 함수1를 호출했기 때문에.
 
 
 
 
 
 