/* 
	
	반복문 : 어디서부터 어디까지
		1.	
			for( 1. 초기값 ; 2. 조건문 ; 4. 증감식 ) {
				3. 실행코드;	
			}
			1. 초기값 : 반복의 처음값
				; : 구역부분
			2. 조건문 : 조건이 true이면 {} 실행 아니면 {} 실행 안함
				;
			3. 실행문 : 반복시 실행될 코드
			4. 증감식 : 반복변수 증가/감소 단위
		
		ex) 1부터 10까지 1씩증가 반복
			for(let i = 1; i <= 10; i++){}
		ex) 1부터 100까지 홀수만 반복
			for(let i = 1; i <= 100; i+=2){}		
	
*/

// 1.
	// let i = 0; // 1. 초기값 ( i는 반복시 사용되는 증감변수 )
	// i < 10	; // 2. 조건문 ( 조건결과가 true이면 {} 실행되는 조건)
	// i++		  // 3. 증감식 ( {} 실행후 다음으로 증감 변수 계산식)
for(let i = 0; i < 3; i++) { // for s
	// i는 0부터 3미만까지 1씩증가 반복
	console.log('반복횟수 : ' + i); 
	
	/*
		순서도 = 알고리즘 != 자료구조
			// * 1. 생활속 순서도 2. 백준 3. 프로그램 개발 순서
			
		1. let i = 0			=> i = 0
		2. i < 3				=> true => {}
		3. console.log();		=> 0 출력
		--------------
		4. i++					=> i = 1
		5. i < 3				=> true => {}
		6. console.log();		=> 1 출력
		--------------
		7. i++					=> i = 1
		8. i<3					=> true => {}
		9. console.log();		=> 2 출력
	*/
} // f end

// 2. 배열(인덱스)와 반복문
let 상자 = ['사과', '포도', '딸기']
	// 1. 반복문 없을때 [ 인덱스 다수일때 힘듬 ]
console.log(상자[0]);
console.log(상자[1]);
console.log(상자[2]);
	// 2. 반복문 사용할때 
for(let i = 0; i < 상자.length; i++) {
	console.log(상자[i]);
} // f end

// 예제1) i는 1부터 10이하까지 1씩 증가 반복 [ 한줄씩 표시 ]
console.log('---------------ex1----------------');
for(let i = 0; i <= 10; i++) {
	console.log(i)
} // f end

// 예제2) i는 1부터 10이하까지 1씩 증가 반복 [ 한줄에 표시]
console.log('---------------ex2----------------');
let output= '' // 문자열을 누적으로 저장할 변수 선언
for(let i = 0; i <= 10; i++) {
	output+= `${i} ` //	\t : 제어문자 (들여쓰기)
} // f end
console.log(output)

// 예제3) i는 1부터 10이하까지 1씩 증가 반복 [ HTML 표시]
console.log('---------------ex3----------------');
output='' // 위에서 선언된 output 변수를 재선언 하지 않고 공백으로 대입 (초기화)
for(let i = 1; i <= 10; i++) {
	output+= `<p>${i}</p>`
} // f end
document.write(output)


// 예제4) i는 1부터 10이하까지 1씩 증가 반복 ( 누적 합계)
console.log('---------------ex4----------------');
let sum = 0;
for(let i = 1; i <= 10; i++) {
	
	// 1. sum = sum + i
	// 2. sum += i
	sum += i; // 기존 sum 변수에 i를 더한값을 sum 변수에 대입
} // f end
console.log(sum)
/* 
	
	초기값 i = 1 / sum = 0;
	for 시작
		i		조건			실행		누계			증감
		i = 1	1<=10 T		sum+=1	0+1=>1		i++
		i = 2	2<=10 T		sum+=2	1+2=>3		i++
		i = 3	3<=10 T		sum+=3	3+3=>6		i++
		i = 4	4<=10 T		sum+=4	6+4=>10		i++
		i = 5	5<=10 T		sum+=5	10+5=>15	i++
*/

// 예5) i는 1부터 100까지 7배수 누적합계
console.log('---------------ex5----------------');
	// 1. 7씩 증가방식
sum = 0;
for(let i = 1; i <= 100 ; i += 7) { sum += i}
console.log(sum)
	// 2. if( 값%7 == 0) 
sum = 0;
for(let i = 1; i<=100; i++)  {
	if(i%7==0) {sum+=i}	
}
console.log(sum)

// 예6) [구구단] 2단
console.log('---------------ex6----------------');
const 단 = 2;
for(let i = 1; i <= 9; i++) {
	console.log(`${단} * ${i} = ${단*i}` )
	console.log(단 + ' * ' + i + ' = ' +  단*i)
}

// 예7) 구구단
console.log('---------------ex7----------------');
for(let i = 2; i <= 9; i++) {
	for(let j = 1; j <= 9; j++){
		console.log(`${i} * ${j} = ${i*j}`)
	}
}

