/*
	- 변수 : 데이터 1개를 저장하는 메모리 공간
		- 저장된 데이터가 변경이 가능하다. 
		- let 변수 선언시 사용되는 키워드
		- 변하는 값, [임시 목적으로 저장]
	- 상수 : 데이터 1개를 저장하는 메모리 공간
		- 저장된 데이터는 변경이 불가능하다.
		- const 상수 선언시 사용되는 키워드
		- 고정된 값, 변하지 않는 값, 일정한 값 [파이(3.14...) 등등 ]
		
	- 변수/상수 사용법(선언/만들기 형태)
		1. 선언 키워드 (let or const)
		2. 변수/상수 명(데이터 저장 상자의 이름) 영문, 카멜표기법,  띄어쓰기 x, 숫자로 시작 x
			카멜표기법 classname --> className
		3. 대입연산자 =
			오른쪽 데이터가 왼쪽에 대입/저장
		4. 데이터
		
	- 변수/상수 사용
		1. 호출 : 호출할 변수명
		2. 수정 : 수정할 변수명 = 새로운 데이터
		
	- 연산자 [연산/계산시 사용되는 특수문자]
		1. 산술연산자 : 결과값으로 출력
				+더하기 -뺴기 *곱하기 /나누기 %나머지
				몫 ; parseInt
		2. 연결연산자 : +연결연산자
				숫자+숫자 [ +더하기 ]  변수1 + 변수2 만약에 두 변수 모두 숫자가 저장되어있으면 더하기
				숫자+'문자' [ +연결연산자]
				'문자'+'문자' [ +연결연산자]
		
		3. 비교연산자 : 결과 true or false  로 출력된다.
				> 초과/크다   		<미만/작다
				>= 이상/크거나 같다 	<=이하/작거나 같다
				== 같다[데이터 비교] 	===같다[데이터형/데이터 비교]
				!=같지않다/아니다 		!==같지않다/아니다
		4. 관계연산자 : 주로 비교 연산자가 2개 이상일때 사용한다. 결과 true or false  로 출력된다.
				&& 이면서 면서 이고 모두 그리고 and (ex. 사탕 and 초콜릿 먹을래 .모두)
				|| 이거나 거나 또는 하나라도 or 조건 (ex. 사탕 or 초콜릿 먹을래 .하나라도)
				! 반대 부정 not조건 	!true => false  / !false => ture
		5. 대입연산자 : 출력은 따로 없다.
				= 대입 [오른쪽 데이터를 왼쪽에 대입시킨다.]
				+= [오른쪽 데이터를 왼쪽에 더한 후에 왼쪽에 대입]
					1. 변수 = 10
					2. 변수 += 30 [+=   1. 더하기를 한다(30+10 => 40)  2. 대입한다.(변수 = 40)]
					3. console.log( 변수 )
				-= *= /= %=
		6. 증감연산자
				++ 1증가 [선위증가 : ++변수 /후위증가 : 변수++]
				-- 1감소 [선위감소 : --변수 /후위감소 : 변수--]
		7. 삼항연산자 : 항이 3개 존재하는 연산자, 결과 true or false  로 출력된다.
				조건 ? 참true : 거짓false
				- 만약에 조건이 true 이면 참 실행
				- 만약에 조건이 false 이면 거짓 실행
				-- 중첩가능
				조건 1 ? 참1 : 조건 2 ? 참2 : 거짓
	
 */


	// 연습하기
	
 //1. 산술연산자
console.log('더하기 : ' + 10+3)   	 //103
console.log('더하기 : ' + (10+3))	  	 //13
console.log('빼기 : ' + (10-3))	  	 //7
console.log('곱하기 : ' + (10*3))	  	 //30
console.log('나누기 : ' + (10/3))	  	 //3.333333~
console.log('나머지 : ' + (10%3))	  	 //1



 
//문제1 : prompt 함수 로 국어 , 영어 , 수학 점수를 입력받아 각 변수에 저장하고 총점 출력 , 평균 출력
let 국어 = Number(prompt('국어점수 :'))  // 입력후에 변수에 저장 안하면 사라지니까 변구에 저장/대입
let 영어 = Number(prompt('영어점수 :'))  //Number('300') => 숫자
let 수학 = Number(prompt('수학점수 :'))  //Number('숫자') => 숫자
let 총점 = 국어 + 영어 + 수학
let 평균 = 총점 /3
console.log('총점 : ' + 총점)
console.log('평균 : ' + 평균)


//문제2 : prompt 함수 로 반지름 입력받아서 원넓이[ 반지름*반지름*3.14 ] 출력
let 반지름 = prompt('반지름 :') // 입력 받기
let 원넓이 = 반지름 * 반지름 * 3.14
console.log('원넓이 : ' + 원넓이)


//문제3 : prompt 함수 로 두 실수를 입력받아서 앞실수의 값이 뒤실수의 값의 몇%인지 출력
let 실수1 = prompt(' 실수1 : ')
let 실수2 = prompt(' 실수2 : ')
let 백분율 = (실수1/실수2) * 100
console.log('두 실수간의 비율 : '+ 백분율 +'%')
 
 
 //2. 비교연산자
 console.log(' 초과 : '+(10>3)) //true
 console.log(' 미만 : '+(10<3)) //false
 console.log(' 이상 : '+(10>=3)) //true
 console.log(' 이하 : '+(10<=3)) //false
 console.log(' 같다 : '+(10==3)) //false
 console.log(' 같지않다 : '+(10!=3)) //true
   
 
 //3. 관계연산자
 console.log(' 이면서 :' + (10>3 && 20>15)) // 10은 3보다 크면서 20은 15보다 크다. true and true
 console.log(' 이면서 :' + (10>3 && 20>30)) // true and false -> false
 console.log(' 이거나 :' + (10>3 || 20>15)) // true or true -> true
 console.log(' 이거나 :' + (10>3 || 20>30)) // true or false -> true
 console.log(' 부정 :' + !(10>3)) // true -> false
 
 
// 문제4 : prompt 함수 로 정수를 입력받아 홀수[true] / 짝수[false] 여부 출력
	// 홀수 : 수%2 == 1 어떤 수에 나누기 2를 했을때 나머지가 1이면 홀수
	// 짝수 : 수%2 == 0 어떤 수에 나누기 2를 했을때 나머지가 0이면 짝수
 let 정수1 = prompt(' 정수1 : '); console.log(' 결과 : ' +  (정수1%2 == 1));


// 문제5 : prompt 함수 로 정수를 입력받아 7배수이면 true / 아니면 false 출력
	// 배수 : 수%값 == 0 어떤 수에 나누기 값을 했을때 나머지가 0이면 그 수는 값의 배수
 let 정수2 = prompt(' 정수2 : '); console.log(' 결과 : ' +  (정수2%7 == 0));
	
	
// 문제6 : prompt 함수 로 십만원 단위의 금액을 입력받아 지폐 개수 세기  356789      결과 : 십만원3장 만원5장 천원6장 
 let 금액 = prompt('십만원 단위의 금액 : '); 							console.log( '입력받은 금액 :' + 금액)
 	// 1. 십만원권 검사
 let 십만원 = parseInt(금액 / 100000); 								console.log( '십만원권 : '+ 십만원 +'장');
 	// 금액/100000 ->3.56789
 	// paeseInt(금액/100000) -> 3
 	
 	// 2. 만원권 검사 [원금에서 십만원권 제외한 ] 356789-300000 -> 56789
 let 만원 = parseInt( (금액 - (십만원*100000)) / 10000); 				console.log( '만원권 : '+ 만원 +'장');
 	// 3. 천원권 검사 [원급에서 십만원권과 만원권 제외한 ] 
 let 천원 = parseInt(( 금액 - (십만원*100000) - (만원*10000)) / 1000); 	console.log( '천원권 : '+ 천원 +'장');
	
	
// 문제7 : prompt 함수 로 아이디와 비밀번호를 입력받아 아이디가 admin 이고 비밀번호가 1234 와 일치하면 결과 : true 출력 아니면 false 출력 
 let 아이디 = prompt (' 아이디 :' )
 let 비밀번호 = prompt (' 비밀번호 :' )
 console.log(' 로그인상태 : ' + (아이디 == 'admin' && 비밀번호 == '1234'))


// 문제8 : prompt 함수로 정수를 입력받아 홀수 이면서 7배수이면 true 아니면 false 출력
 let 정수3 = prompt(' 정수3 : ')
 console.log(' 결과 : ' +  (정수3%2 == 1 && 정수3%7 == 0));
 
 
 // 4. 대입 연산자
 let 데이터1 = 10 // let키워드(변수)로 '데이터1' 이라는 변수명으로 10을 저장 
 console.log( 데이터1 )
	데이터1 += 10 // 1. 더하기한다. 2. 대입한다 -> 데이터1를 호출해서 10 더하고 그 값을 대입한다. 결론 -> 데이터1에는 20이 저장된다.
 console.log( 데이터1 )
	데이터1 -= 5 // 데이터1을 호출해서 5를 빼고 그 값을 대입한다. -> 데이터 1에는 15가 저장된다.
 console.log( 데이터1 )
	데이터1 *=2 // 데이터1을 호출해서 2를 곱하고 그 값을 대입한다. -> 데이터 1에는 30이 저장된다.
 console.log( 데이터1 )
 
 		//예제1
 		let html = '<h3> JS 에서 작성된 HTML 입니다.</h3>'
 		html += '<p> 문단을 추가 했습니다. </p>'
 		// html [ <h3> JS 에서 작성된 HTML 입니다.</h3> <p> 문단을 추가 했습니다. </p>]
		document.write ( html ); // html의 출력함수이다.
 
 // 5. 증감 연산자 [ 데이터+1 , 데이터+=1 , 데이터++ ]
  let 데이터2 = 10
  console.log(' 데이터 :' + 데이터2);		 // 10
  console.log(' 데이터 :' + (데이터2++));	 // 11이 나올 것 같지만 10이 나옴. 후위증가이기 때문이다. [출력후 증가]
  console.log(' 데이터 :' + 데이터2); 		 // 11 이전에 ++ 한것이 있어서 
  console.log(' 데이터 :' + (++데이터2));	 // 선위 증가로 12가 나옴 ! [출력전 증가]
  console.log(' 데이터 :' + (데이터2--)); 	 // 12가 나옴 출력 후 감소라서 ! 
  console.log(' 데이터 :' + 데이터2) ;	 	 // 11 나옴
  console.log(' 데이터 :' + (--데이터2));	 // 10이 나옴
  
 // 6. 삼항 연산자 여기서부터 논리가 들어감 [조건 ?  참 : 거짓 (만약에 조건이 참이면 참코드 실행, 거짓이면 거짓코드 실행)]
 	//예제1
 let 나이 = 38  // '나이'라는 변수에 38를 저장 했다.
 let 연령구간 = 나이<=19 ?  '청소년' : '성인'
 			 //조건 (참,거짓 결과를 갖는 논리 연산)
 	//예제2 [조건1 ?  참1 : 조건 ? 참2 : 조건 ? 참 3 : 거짓]
 console.log ('38의 연령 구간 :' + 연령구간)
 let 점수 = 78
 let 등급 = 점수 >=90 ? 'A등급':
 								점수 >=80 ? 'B등급' :
 													점수 >= 70 ? 'C등급' : '탈락'
		// [조건1 ?  참1 : 		조건 ? 	참2 	:		 조건 ? 참 3 	:		 거짓]
 console.log('점수의 등급 :' + 등급)
 
 
 // 문제9 : 정수 2개를 입력받아 더 큰수 를 출력
 let 비교정수1 = Number(prompt('비교할 정수 입력 : '))
 let 비교정수2 = Number(prompt('비교할 정수 입력 : '))
 let 큰수 = 비교정수1>비교정수2 ? 비교정수1 : 비교정수2
 console.log ('두 정수 중 더 큰수 : ' + 큰수)
 console.log ('두 정수 중 더 큰수 : ' + (비교정수1>비교정수2 ? 비교정수1 : 비교정수1<비교정수2 ? 비교정수2  : '두 수는 같다.'))
 
 // 문제10 : 정수 3개를 입력받아 가장 큰수 를 출력 
 let 비교정수3 = Number(prompt('비교할 정수 입력 : '))
 let 비교정수4 = Number(prompt('비교할 정수 입력 : '))
 let 비교정수5 = Number(prompt('비교할 정수 입력 : '))
 
 	//변수 활용
 let 가장큰 =  비교정수3 //1. '가장큰' 변수에 첫번째 입력값 저장한다.
 가장큰 = 가장큰 < 비교정수4 ? 비교정수4 : 가장큰 //2. 만약에 '가장큰' 보다 두번째 입력값이 더 크면 두번째 값을 저장/아니면 그대로
 가장큰 = 가장큰 < 비교정수5 ? 비교정수5 : 가장큰 //3. 만약에 '가장큰' 보다 세번째 입력값이 더 크면 두번째 값을 저장/아니면 그대로
 console.log ('세 정수 중 더 큰수 : ' + 가장큰)
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 